## PostreSQL

In [7]:
# postgres_example.py
import psycopg2
from psycopg2 import sql

# --- Parámetros de conexión ---
# Asegúrate de que el contenedor Docker esté corriendo
DB_HOST = "localhost"
DB_PORT = "5432"
DB_NAME = "postgres"  # Base de datos por defecto
DB_USER = "postgres"  # Usuario por defecto
DB_PASS = "mysecretpassword" # La que pusiste en el comando docker run

In [8]:
# 1. Establecer la conexión
conn = psycopg2.connect(
    host=DB_HOST,
    port=DB_PORT,
    dbname=DB_NAME,
    user=DB_USER,
    password=DB_PASS
)
print("Conexión a PostgreSQL exitosa!")

Conexión a PostgreSQL exitosa!

In [9]:
# 2. Crear un cursor (autocommit=True para que los cambios se apliquen inmediatamente)
conn.autocommit = True
cursor = conn.cursor()

# 3. Ejecutar queries
# Limpieza previa (opcional)
cursor.execute("DROP TABLE IF EXISTS usuarios;")

# Crear tabla
create_table_query = """
CREATE TABLE usuarios (
    id SERIAL PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    email VARCHAR(50) UNIQUE NOT NULL
);
"""
cursor.execute(create_table_query)
print("Tabla 'usuarios' creada.")

# Insertar datos de forma segura para evitar inyección SQL
insert_query = "INSERT INTO usuarios (nombre, email) VALUES (%s, %s);"
usuarios_a_insertar = [
    ('Ana', 'ana@example.com'),
    ('Carlos', 'carlos@example.com')
]
cursor.executemany(insert_query, usuarios_a_insertar)
print(f"{cursor.rowcount} usuarios insertados.")

# 4. Consultar y obtener resultados
cursor.execute("SELECT id, nombre, email FROM usuarios ORDER BY nombre;")

print("\n--- Usuarios en la base de datos ---")
for row in cursor.fetchall():
    print(f"ID: {row[0]}, Nombre: {row[1]}, Email: {row[2]}")

Tabla 'usuarios' creada.
2 usuarios insertados.

--- Usuarios en la base de datos ---
ID: 1, Nombre: Ana, Email: ana@example.com
ID: 2, Nombre: Carlos, Email: carlos@example.com

In [10]:
# 5. Cerrar la conexión
if conn is not None:
    conn.close()
    print("\nConexión a PostgreSQL cerrada.")

Conexión a PostgreSQL cerrada.

In [11]:
from sqlalchemy import create_engine

URL GENERICA CONEXION BASE DE DATOS
```
<protocolo>://<usuario>:<contraseña>@<host>:<puerto>/<nombre_base_de_datos>
´´´

In [12]:
churro = 'postgresql://postgres:mysecretpassword@localhost:5432/postgres'
engine = create_engine(churro)

In [13]:
churro = 'postgresql://postgres:mysecretpassword@localhost:5432/postgres'
engine = create_engine(churro)

In [14]:
import pandas as pd
pd.read_sql('SELECT * FROM usuarios', engine)

   id  nombre               email
0   1     Ana     ana@example.com
1   2  Carlos  carlos@example.com

In [15]:
df = pd.DataFrame(
    {"col1":[1,2,3,4,5],
    "col2":[10,20,30,40,50]}
)

In [16]:
df.to_sql(index=False, name="test", if_exists="replace", con=engine)  
#'index=False' to avoid uploading the position index with it
#'if_exist'; "append" (add to existing table) or "replace" (delete n make a new table)

5

In [17]:
pd.read_sql("SELECT * FROM test;", engine)

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

## MYSQL

In [18]:
churro = 'postgresql://postgres:mysecretpassword@localhost:5432/postgres'
engine = create_engine(churro)

In [19]:
# mysql_example.py
import mysql.connector
from mysql.connector import errorcode

# --- Parámetros de conexión ---
# Asegúrate de que el contenedor Docker esté corriendo
DB_HOST = "localhost"
DB_PORT = "3306"
DB_USER = "root"
DB_PASS = "mysecretpassword" # La que pusiste en el comando docker run
DB_NAME = "testdb" # Crearemos esta base de datos

In [20]:
# 1. Establecer la conexión (sin especificar la base de datos al principio)
conn = mysql.connector.connect(
        host=DB_HOST,
        port=DB_PORT,
        user=DB_USER,
        password=DB_PASS
)
print("Conexión a MySQL exitosa!")

Conexión a MySQL exitosa!

In [21]:
cursor = conn.cursor()
# Crear la base de datos si no existe
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {DB_NAME} CHARACTER SET 'utf8mb4'")
cursor.execute(f"USE {DB_NAME}")
print(f"Usando la base de datos '{DB_NAME}'.")

# 3. Ejecutar queries
# Limpieza previa (opcional)
cursor.execute("DROP TABLE IF EXISTS usuarios;")

# Crear tabla
create_table_query = """
CREATE TABLE usuarios (
    id INT AUTO_INCREMENT PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    email VARCHAR(50) UNIQUE NOT NULL
) ENGINE=InnoDB;
"""
cursor.execute(create_table_query)
print("Tabla 'usuarios' creada.")

# Insertar datos
insert_query = "INSERT INTO usuarios (nombre, email) VALUES (%s, %s)"
usuarios_a_insertar = [
    ('Ana', 'ana@example.com'),
    ('Carlos', 'carlos@example.com')
]
cursor.executemany(insert_query, usuarios_a_insertar)
conn.commit() # En mysql-connector, el commit es manual
print(f"{cursor.rowcount} usuarios insertados.")

# 4. Consultar y obtener resultados
cursor.execute("SELECT id, nombre, email FROM usuarios ORDER BY nombre;")

print("\n--- Usuarios en la base de datos ---")
for (id, nombre, email) in cursor:
    print(f"ID: {id}, Nombre: {nombre}, Email: {email}")

Usando la base de datos 'testdb'.
Tabla 'usuarios' creada.
2 usuarios insertados.

--- Usuarios en la base de datos ---
ID: 1, Nombre: Ana, Email: ana@example.com
ID: 2, Nombre: Carlos, Email: carlos@example.com

In [34]:
from sqlalchemy import create_engine
churro = 'mysql+pymysql://root:mysecretpassword@localhost:3306/testdb'
engine = create_engine(churro)

In [35]:
import pandas as pd
pd.read_sql('SELECT * FROM usuarios', engine)

   id  nombre               email
0   1     Ana     ana@example.com
1   2  Carlos  carlos@example.com

In [36]:
df = pd.DataFrame(
    {"col1":[1,2,3,4,5],
    "col2":[10,20,30,40,50]}
)

In [37]:
df.to_sql(index=False, name="test_myaql", if_exists="replace", con=engine)

5

In [38]:
pd.read_sql("SELECT * FROM test_myaql;", engine)

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

## SQLLite

In [48]:
import sqlite3

sqlitedb = "mi_db.db"

churro = "sqlite:///mi_db.db" 
engine_sqlite = create_engine(churro)

In [46]:
df.to_sql(index=False, name="nueva_tabla", if_exists="replace", con=engine_sqlite)

5

In [47]:
pd.read_sql("SELECT * FROM nueva_tabla;", engine_sqlite)

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50